articles/whichmedia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-26 Sun 20:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Medium Choice</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Medium Choice</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org32b2b03">Selecting Medium for Media</a>
<ul>
<li><a href="#orgb2cf901">Meaningful Interactions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org32b2b03" class="outline-1">
<h1 id="org32b2b03">Selecting Medium for Media</h1>
<div class="outline-text-1" id="text-org32b2b03">
<p>
All mediums of media have tradeoffs. When I evaluate media, I often express frustration or praise for media which "understands why it is [a video game / an anime / etc]".
</p>

<p>
Media which is immediately better after being adapted to a different medium (i.e. a television adaptation of a cinematic video game) are by and large <i>poor media</i> even if they are <i>good stories</i> &#x2013; and on the flipside, media which does not survive adaptation to other mediums (e.g. <i>Avatar: The Last Airbender</i> as a cartoon vs a live-action film) are good examples of media which has selected the correct medium for their intended purpose. This is part of why video game movie adaptations are often extremely bad: they are an attempt to translate an interactive medium to something explicitly non-interactive. If the outcome is bad, that often counterintuitively <i>explicitly</i> suggests that the original is good, despite frequent criticisms that poor movie adaptation means "the story sucks". 
</p>
</div>

<div id="outline-container-orgb2cf901" class="outline-2">
<h2 id="orgb2cf901">Meaningful Interactions</h2>
<div class="outline-text-2" id="text-orgb2cf901">
<p>
Video Games are an interactive form of multimedia. If you abstract this part away (i.e. via watching somebody else play through the game with no commentary), then video games are minimally different from other visual multimedia mediums. Many games seem specifically optimized for the experience of <i>being watched</i> rather than <i>being played</i>, and this is almost always a net negative effect upon the final product.
</p>

<p>
To point to some concrete examples, let's refer to one of the most story-driven genres of video games: JRPGs. These games are often 30+ hours long, and often force the player to read hundreds of lines of dialogue or watch many hours of cutscenes. By itself, this is a neutral thing about the genre: it can be good or bad. But a question which is useful for evaluating the relative quality of a JRPG is "why is this a JRPG and not a [novel / movie / etc]".
</p>

<p>
Narrowing in on this particular question, a good answer to this question will almost invariably use the interactive component of the medium in a very good way. In the <i>pokemon</i> games, this is usually about a collect-a-thon experience mixed with a relatively complicated, layered rock-paper-scissors battle system. In <i>Undertale</i>, there is an entire forgiveness theme which is explored in every fight, with different endings based on the behaviors exhibited by the player in these "lowly" interactions. In <i>Suikoden</i>, the player will attempt to gather people to join their army, involving them going around and talking to people themselves. 
</p>

<p>
But a lot of these games do not have a satisfying answer to this question. Nay, a lot of them feel like they have not thought about this question at all. Games following a linear story rail, with generic random encounters which have no real purpose other than to pad the game's length. You get the sense playing these games that the "game" is the cutscenes and the dialogue, and that all of the encounters are just "spacers" which exist to make you wait before the next part of the game.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
